Ran Plan for dir: `infra/gcp/terraform/k8s-staging-images` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.artifact_registry["agent-sandbox"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/agent-sandbox"
        name                   = "agent-sandbox"
      ~ update_time            = "2025-11-25T17:13:20.737743Z" -> "2025-12-03T17:47:47.786136Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["cloud-provider-kind"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/cloud-provider-kind"
        name                   = "cloud-provider-kind"
      ~ update_time            = "2025-11-25T10:49:07.105086Z" -> "2025-12-03T20:52:45.658435Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["contributor-site"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/contributor-site"
        name                   = "contributor-site"
      ~ update_time            = "2025-11-19T17:27:23.971093Z" -> "2025-11-28T13:36:48.408576Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["csi-vsphere"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/csi-vsphere"
        name                   = "csi-vsphere"
      ~ update_time            = "2025-11-25T15:41:31.178744Z" -> "2025-12-05T08:30:26.734274Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["dra-example-driver"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/dra-example-driver"
        name                   = "dra-example-driver"
      ~ update_time            = "2025-10-30T07:32:59.319403Z" -> "2025-11-26T08:38:14.493887Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["gateway-api-inference-extension"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/gateway-api-inference-extension"
        name                   = "gateway-api-inference-extension"
      ~ update_time            = "2025-11-25T17:23:18.944644Z" -> "2025-12-05T07:19:10.295005Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["ingress-nginx"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/ingress-nginx"
        name                   = "ingress-nginx"
      ~ update_time            = "2025-11-25T10:48:15.203365Z" -> "2025-12-04T02:30:00.915900Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["jobset"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/jobset"
        name                   = "jobset"
      ~ update_time            = "2025-11-25T02:31:32.437238Z" -> "2025-12-05T02:52:50.275678Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["kro"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/kro"
        name                   = "kro"
      ~ update_time            = "2025-11-25T08:53:28.664873Z" -> "2025-12-05T00:23:50.703858Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["kueue"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/kueue"
        name                   = "kueue"
      ~ update_time            = "2025-11-25T16:52:50.949330Z" -> "2025-12-05T08:49:18.590704Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["lws"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/lws"
        name                   = "lws"
      ~ update_time            = "2025-11-25T09:03:33.956982Z" -> "2025-12-04T18:38:57.243873Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["minikube"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/minikube"
        name                   = "minikube"
      ~ update_time            = "2025-08-28T19:30:36.700112Z" -> "2025-12-04T23:16:07.166169Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.artifact_registry["agent-sandbox"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["agent-sandbox"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["aws-encryption-provider"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["aws-encryption-provider"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["charts"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["charts"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["cloud-provider-kind"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["cloud-provider-kind"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["cluster-capacity"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["cluster-capacity"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["contributor-site"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["contributor-site"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["csi-vsphere"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["csi-vsphere"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["dra-driver-cpu"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["dra-driver-cpu"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["dra-example-driver"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["dra-example-driver"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["etcd"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["etcd"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["etcd-manager"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["etcd-manager"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["gateway-api-inference-extension"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["gateway-api-inference-extension"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["headlamp"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["headlamp"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["inference-perf"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["inference-perf"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["infra-tools"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["infra-tools"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["ingate"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["ingate"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["ingress-nginx"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["ingress-nginx"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["jobset"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["jobset"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["karpenter-cluster-api"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["karpenter-cluster-api"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["kind"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["kind"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["kro"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["kro"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["kubemark"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["kubemark"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["kubernetes"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["kubernetes"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["kueue"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["kueue"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["lws"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["lws"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["maintainer-tools"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["maintainer-tools"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["minikube"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["minikube"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["node-readiness-controller"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us-central1"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-staging-images"
      + repository_id          = "node-readiness-controller"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-90-days"

          + condition {
              + older_than            = "7776000s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.artifact_registry["node-readiness-controller"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "allUsers"
      + project    = "k8s-staging-images"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["node-readiness-controller"].google_artifact_registry_repository_iam_member.writers["group:k8s-infra-staging-nrc@kubernetes.io"] will be created
+ resource "google_artifact_registry_repository_iam_member" "writers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "group:k8s-infra-staging-nrc@kubernetes.io"
      + project    = "k8s-staging-images"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.artifact_registry["node-readiness-controller"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["node-readiness-controller"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["secrets-store-sync"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["secrets-store-sync"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.artifact_registry["test-infra"].google_project_iam_member.roles["roles/artifactregistry.serviceAgent"] will be created
+ resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + role    = "roles/artifactregistry.serviceAgent"
    }

  # module.artifact_registry["test-infra"].google_project_service_identity.artifact_registry_sa will be created
+ resource "google_project_service_identity" "artifact_registry_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "k8s-staging-images"
      + service = "artifactregistry.googleapis.com"
    }

  # module.iam.google_project_iam_binding.project_iam_authoritative["default--roles/viewer"] will be updated in-place
~ resource "google_project_iam_binding" "project_iam_authoritative" {
        id      = "k8s-staging-images/roles/viewer"
      ~ members = [
          + "group:k8s-infra-staging-nrc@kubernetes.io",
            # (28 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 63 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/k8s-staging-images
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fk8s-staging-images%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/k8s-staging-images
  ```

**Note: Objects have changed outside of Terraform**
Plan: 63 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```